Tekla Open API Reference for Tekla Structures 2025
AnalysisModel.ResultsModificationIdentifier Property
 Gets or sets the results modification identifier.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Identifier ResultsModificationIdentifier { get; set; }
Public Property ResultsModificationIdentifier As Identifier
	Get
	Set
Property Value
Type: Identifier
See Also
Reference
AnalysisModel Class
Tekla.Structures.Analysis Namespace